[
  {
    "index": 0,
    "name": "mobilenetv2_1.00_224",
    "class_name": "Functional",
    "input_shape": "(None, 224, 224, 3)",
    "output_shape": "(None, 7, 7, 1280)",
    "num_params": 2257984
  },
  {
    "index": 1,
    "name": "global_average_pooling2d",
    "class_name": "GlobalAveragePooling2D",
    "input_shape": null,
    "output_shape": null,
    "num_params": 0
  },
  {
    "index": 2,
    "name": "dropout",
    "class_name": "Dropout",
    "input_shape": null,
    "output_shape": null,
    "num_params": 0
  },
  {
    "index": 3,
    "name": "dense",
    "class_name": "Dense",
    "input_shape": null,
    "output_shape": null,
    "num_params": 655872
  },
  {
    "index": 4,
    "name": "dropout_1",
    "class_name": "Dropout",
    "input_shape": null,
    "output_shape": null,
    "num_params": 0
  },
  {
    "index": 5,
    "name": "dense_1",
    "class_name": "Dense",
    "input_shape": null,
    "output_shape": null,
    "num_params": 77463
  }
]