{
  "modelTopology": {
    "class_name": "Functional",
    "config": {
      "name": "sequential",
      "trainable": true,
      "dtype": {
        "module": "keras",
        "class_name": "DTypePolicy",
        "config": {
          "name": "float32"
        },
        "registered_name": null
      },
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batchInputShape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer_1",
            "optional": false
          },
          "registered_name": null
        },
        {
          "module": "keras.src.models.functional",
          "class_name": "Functional",
          "config": {
            "name": "mobilenetv2_1.00_224",
            "trainable": false,
            "layers": [
              {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                  "batchInputShape": [
                    null,
                    224,
                    224,
                    3
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "input_layer",
                  "optional": false
                },
                "registered_name": null,
                "name": "input_layer",
                "inbound_nodes": []
              },
              {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                  "name": "Conv1",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "filters": 32,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    2,
                    2
                  ],
                  "padding": "same",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "linear",
                  "use_bias": false,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    224,
                    224,
                    3
                  ]
                },
                "name": "Conv1",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            224,
                            224,
                            3
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "input_layer",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "bn_Conv1",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.999,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false,
                  "renorm": false,
                  "renorm_clipping": null,
                  "renorm_momentum": 0.99
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    32
                  ]
                },
                "name": "bn_Conv1",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "Conv1",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "ReLU",
                "config": {
                  "name": "Conv1_relu",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "max_value": 6.0,
                  "negative_slope": 0.0,
                  "threshold": 0.0
                },
                "registered_name": null,
                "name": "Conv1_relu",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "bn_Conv1",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "DepthwiseConv2D",
                "config": {
                  "name": "expanded_conv_depthwise",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "depth_multiplier": 1,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "same",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "activation": "linear",
                  "use_bias": false,
                  "depthwise_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "depthwise_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "depthwise_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    32
                  ]
                },
                "name": "expanded_conv_depthwise",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "Conv1_relu",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "expanded_conv_depthwise_BN",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.999,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false,
                  "renorm": false,
                  "renorm_clipping": null,
                  "renorm_momentum": 0.99
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    32
                  ]
                },
                "name": "expanded_conv_depthwise_BN",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "expanded_conv_depthwise",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "ReLU",
                "config": {
                  "name": "expanded_conv_depthwise_relu",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "max_value": 6.0,
                  "negative_slope": 0.0,
                  "threshold": 0.0
                },
                "registered_name": null,
                "name": "expanded_conv_depthwise_relu",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "expanded_conv_depthwise_BN",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                  "name": "expanded_conv_project",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "filters": 16,
                  "kernel_size": [
                    1,
                    1
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "same",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "linear",
                  "use_bias": false,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    32
                  ]
                },
                "name": "expanded_conv_project",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            32
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "expanded_conv_depthwise_relu",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "expanded_conv_project_BN",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.999,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false,
                  "renorm": false,
                  "renorm_clipping": null,
                  "renorm_momentum": 0.99
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    16
                  ]
                },
                "name": "expanded_conv_project_BN",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            16
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "expanded_conv_project",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                  "name": "block_1_expand",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "filters": 96,
                  "kernel_size": [
                    1,
                    1
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "same",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "linear",
                  "use_bias": false,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    16
                  ]
                },
                "name": "block_1_expand",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            16
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "expanded_conv_project_BN",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "block_1_expand_BN",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.999,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false,
                  "renorm": false,
                  "renorm_clipping": null,
                  "renorm_momentum": 0.99
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    96
                  ]
                },
                "name": "block_1_expand_BN",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            96
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_expand",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "ReLU",
                "config": {
                  "name": "block_1_expand_relu",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "max_value": 6.0,
                  "negative_slope": 0.0,
                  "threshold": 0.0
                },
                "registered_name": null,
                "name": "block_1_expand_relu",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            96
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_expand_BN",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "ZeroPadding2D",
                "config": {
                  "name": "block_1_pad",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "padding": [
                    [
                      0,
                      1
                    ],
                    [
                      0,
                      1
                    ]
                  ],
                  "data_format": "channels_last"
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    112,
                    112,
                    96
                  ]
                },
                "name": "block_1_pad",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            112,
                            112,
                            96
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_expand_relu",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "DepthwiseConv2D",
                "config": {
                  "name": "block_1_depthwise",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "depth_multiplier": 1,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "activation": "linear",
                  "use_bias": false,
                  "depthwise_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "depthwise_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "depthwise_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    113,
                    113,
                    96
                  ]
                },
                "name": "block_1_depthwise",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            113,
                            113,
                            96
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_pad",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "block_1_depthwise_BN",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.999,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false,
                  "renorm": false,
                  "renorm_clipping": null,
                  "renorm_momentum": 0.99
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    56,
                    56,
                    96
                  ]
                },
                "name": "block_1_depthwise_BN",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            56,
                            56,
                            96
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_depthwise",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "ReLU",
                "config": {
                  "name": "block_1_depthwise_relu",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "max_value": 6.0,
                  "negative_slope": 0.0,
                  "threshold": 0.0
                },
                "registered_name": null,
                "name": "block_1_depthwise_relu",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            56,
                            56,
                            96
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_depthwise_BN",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                  "name": "block_1_project",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "filters": 24,
                  "kernel_size": [
                    1,
                    1
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "same",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "linear",
                  "use_bias": false,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    56,
                    56,
                    96
                  ]
                },
                "name": "block_1_project",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            56,
                            56,
                            96
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_depthwise_relu",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "block_1_project_BN",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.999,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
                  "gamma_regularizer": null,
                  "beta_constraint": null,
                  "gamma_constraint": null,
                  "synchronized": false,
                  "renorm": false,
                  "renorm_clipping": null,
                  "renorm_momentum": 0.99
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    56,
                    56,
                    24
                  ]
                },
                "name": "block_1_project_BN",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            56,
                            56,
                            24
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_project",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {
                      "mask": null
                    }
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "Conv2D",
                "config": {
                  "name": "block_2_expand",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "filters": 144,
                  "kernel_size": [
                    1,
                    1
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "same",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "linear",
                  "use_bias": false,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                  "input_shape": [
                    null,
                    56,
                    56,
                    24
                  ]
                },
                "name": "block_2_expand",
                "inbound_nodes": [
                  {
                    "args": [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [
                            null,
                            56,
                            56,
                            24
                          ],
                          "dtype": "float32",
                          "keras_history": [
                            "block_1_project_BN",
                            0,
                            0
                          ]
                        }
                      }
                    ],
                    "kwargs": {}
                  }
                ]
              },
              {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                  "name": "block_2_expand_BN",
                  "trainable": false,
                  "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                      "name": "float32"
                    },
                    "registered_name": null
                  },
                  "axis": -1,
                  "momentum": 0.999,
                  "epsilon": 0.001,
                  "center": true,
                  "scale": true,
                  "beta_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "gamma_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_mean_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "moving_variance_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Ones",
                    "config": {},
                    "registered_name": null
                  },
                  "beta_regularizer": null,
